Revit 2027 API
ConnectorElement.CreateConduitConnector(Document, Reference, Edge) Method
 Create a new conduit ConnectorElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ConnectorElement CreateConduitConnector(
	Document document,
	Reference planarFace,
	Edge edge
)
Public Shared Function CreateConduitConnector (
	document As Document,
	planarFace As Reference,
	edge As Edge
) As ConnectorElement
public:
static ConnectorElement^ CreateConduitConnector(
	Document^ document,
	Reference^ planarFace,
	Edge^ edge
)
static member CreateConduitConnector :
        document : Document *
        planarFace : Reference *
        edge : Edge -> ConnectorElement
Parameters
document Document
 The document to add the connector to.
planarFace Reference
 The planar face to place the connector on.
edge Edge
 One of the edges in the edge loop that defines the connector location on the planar face.
Return Value
ConnectorElement
 The conduit ConnectorElement.
Exceptions
Exception | Condition
ArgumentException |  The reference is not a planar face. -or- document is not a family document. -or- Thrown when the edge does not belong to the face.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Connector creation is not allowed in this family.
Remarks
 Regenerates the document.
See Also
Reference
ConnectorElement Class
CreateConduitConnector Overload
Autodesk.Revit.DB Namespace